---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LinkElementId
source: html/dccd1367-b891-92f1-f0d2-ece20af2b0cc.htm
---
# LinkElementId Members

Creates a new LinkElementId representing an element in the host document.